{
  "backend/main.mo": "Manages video sessions, including creating sessions, storing segments, exposing public views, and updating segment statuses.",
  "feature_evidence.json": "Defines feature-to-file mappings and metadata for recent UX improvements, including error handling, Grok view, and generation flow updates.",
  "frontend-file-summaries.txt": "Lists short summaries of all frontend source files, describing styling, components, hooks, and provider behaviors.",
  "frontend/index.css": "Defines Tailwind base layers and color variables for light and dark themes using OKLCH values.",
  "frontend/index.html": "HTML entry point that sets metadata and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app orchestrating the multi-step video generation flow, Grok configuration, and user actions like generate, compose, and retry.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper with themed header, background image, footer, and global structure for all pages.",
  "frontend/src/components/BottomActionBar.tsx": "Fixed bottom bar rendering a primary action button with loading and disabled states.",
  "frontend/src/components/ClipSegmentsList.tsx": "Renders the list of generated clips with status indicators, progress, error handling, and optional Grok live view.",
  "frontend/src/components/ClipVideoPreview.tsx": "Displays a video clip with error handling, retry support, and fallback UI for missing or invalid URLs.",
  "frontend/src/components/ComposedVideoPreview.tsx": "Handles client‑side video composition, progress display, errors, downloads, and preview of the final composed video.",
  "frontend/src/components/ErrorNotice.tsx": "Shows a reusable error alert with retry and start‑over action buttons.",
  "frontend/src/components/GrokLiveView.tsx": "Embeds Grok’s interface in an iframe with fallback handling when embedding is blocked.",
  "frontend/src/components/MobileStepper.tsx": "Displays a step indicator for prompt, clips, compose, and download stages on mobile.",
  "frontend/src/components/PromptComposer.tsx": "Provides UI for entering prompts, configuring clip parameters, uploading reference images, and managing Grok runtime configuration.",
  "frontend/src/components/ReferenceImageUpload.tsx": "Component for uploading, validating, previewing, and removing reference images with limits and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useLiveGenerationProgress.ts": "Computes live clip-generation progress with a timer-based smooth progress indicator.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching a video session and user sessions via the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state and persists it to localStorage while updating the document class.",
  "frontend/src/hooks/useVideoProvider.ts": "Tracks the selected video provider and whether Grok is properly configured, updating on runtime config changes.",
  "frontend/src/hooks/useVideoSession.ts": "Handles full video-generation workflow including session creation, segment status updates, clip generation, and errors.",
  "frontend/src/index.css": "Defines Tailwind base styles and a coral-themed light/dark design system with responsive and mobile-friendly rules.",
  "frontend/src/lib/download.ts": "Provides a video download utility supporting blob and remote URLs with error handling and extension inference.",
  "frontend/src/lib/duration.ts": "Supplies duration calculations, tolerance checks, validation messages, and clip duration splitting utilities.",
  "frontend/src/lib/fileEncoding.ts": "Encodes image files to base64 for API use and handles multiple image encoding with error propagation.",
  "frontend/src/lib/grokEndpoint.ts": "Validates and normalizes Grok API endpoints, including canonicalization and format checks.",
  "frontend/src/lib/grokRuntimeConfig.ts": "Manages Grok runtime config in localStorage with validation, change events, and legacy endpoint detection.",
  "frontend/src/lib/referenceImages.ts": "Defines limits and utilities for validating, naming, sizing, and previewing reference image files.",
  "frontend/src/lib/videoCompose.ts": "Implements basic video composition flow with progress callbacks and fallback behavior for multiple clips.",
  "frontend/src/lib/videoValidation.ts": "Validates video URLs and clip data using HEAD checks or video element loading with detailed error handling.",
  "frontend/src/main.tsx": "Initializes React app root with query client and Internet Identity provider.",
  "frontend/src/providers/grokProvider.ts": "Handles Grok AI config resolution, validates endpoints, encodes reference images, and sends video-generation requests with error handling.",
  "frontend/src/providers/videoProvider.ts": "Provides a wrapper around Grok provider functions, exposing clip generation and segment derivation using Grok as the sole video backend.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, container settings, and additional plugins.",
  "project_state.json": "Stores project state, including high-level goals, architectural notes, known issues, and tracked feature metadata for the Grok-powered video app."
}