{
  "backend/main.mo": "Motoko canister managing video sessions, segments, their statuses, and retrieval/update APIs.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing multiple frontend files and their functionality.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme variables and global styling rules.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling prompt input, clip generation workflow, and Grok API initialization.",
  "frontend/src/components/AppShell.tsx": "App layout component providing header, theming toggle, background image, and footer.",
  "frontend/src/components/BottomActionBar.tsx": "Mobile‑optimized bottom action bar rendering a single large CTA button.",
  "frontend/src/components/ClipSegmentsList.tsx": "Displays generation progress, per‑clip statuses, previews, and error handling for video segments.",
  "frontend/src/components/ClipVideoPreview.tsx": "Shows a video preview with error handling and retry support for failed loads.",
  "frontend/src/components/ComposedVideoPreview.tsx": "Manages video composition status, errors, progress, and downloads for composed or individual clips.",
  "frontend/src/components/ErrorNotice.tsx": "Displays an error alert with optional retry and start-over actions.",
  "frontend/src/components/MobileStepper.tsx": "Renders a four-step mobile progress indicator for the prompt-to-download workflow.",
  "frontend/src/components/PromptComposer.tsx": "Provides UI for editing prompts, durations, reference images, and Grok runtime configuration.",
  "frontend/src/components/ReferenceImageUpload.tsx": "Handles reference image selection, validation, preview management, and removal.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, supporting login, logout, and status tracking.",
  "frontend/src/hooks/useLiveGenerationProgress.ts": "Tracks clip-generation progress with a ticking animation and returns computed progress and status labels.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching a video session or a user's sessions from the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state, applies the theme to the document, and persists it to localStorage.",
  "frontend/src/hooks/useVideoProvider.ts": "Returns the active video provider and tracks whether Grok is correctly configured, updating on runtime config changes.",
  "frontend/src/hooks/useVideoSession.ts": "Manages video generation sessions, including creating sessions, generating clips, updating statuses, and handling errors.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm coral-themed design system with light and dark mode variables and mobile-friendly adjustments.",
  "frontend/src/lib/download.ts": "Implements a robust video download utility handling blob and remote URLs, extension inference, and error reporting.",
  "frontend/src/lib/duration.ts": "Provides duration utilities for validating, calculating, and splitting clip durations with tolerance rules.",
  "frontend/src/lib/fileEncoding.ts": "Provides functions to convert image files to base64 and batch‑encode multiple images with error handling.",
  "frontend/src/lib/grokEndpoint.ts": "Validates and normalizes Grok API endpoints, including canonical endpoint handling and quick format checks.",
  "frontend/src/lib/grokRuntimeConfig.ts": "Loads, saves, validates, and manages Grok runtime config in localStorage with change notifications and legacy endpoint detection.",
  "frontend/src/lib/referenceImages.ts": "Defines image validation rules and helper utilities for formatting filenames, file sizes, and generating preview URLs.",
  "frontend/src/lib/videoCompose.ts": "Checks browser composition capability and simulates multi‑clip composition, returning a clip URL with progress updates.",
  "frontend/src/lib/videoValidation.ts": "Validates video URLs via HEAD requests or video element loading and checks clip data structure integrity.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider.",
  "frontend/src/providers/grokProvider.ts": "Retrieves Grok configuration and handles video generation requests, including endpoint validation, image encoding, API calling, and response validation.",
  "frontend/src/providers/videoProvider.ts": "Exposes Grok-based video generation functions and defines the ClipData structure, always using Grok as the provider.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, content scanning, plugin setup, and extensive theme extensions for colors, typography, and layout.",
  "project_state.json": "Stores project metadata, architecture notes, known issues, and feature definitions for the Grok-powered video generation app."
}