{
  "backend/main.mo": "Motoko actor managing video sessions with segment creation, status updates, and public querying via in‑memory maps.",
  "feature_evidence.json": "Feature evidence report linking product requirements to frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files and modules.",
  "frontend/index.css": "Tailwind base layer and OKLCH theme variables defining light/dark color systems and global style tokens.",
  "frontend/index.html": "Minimal HTML shell loading the React app via main.tsx with mobile-friendly metadata.",
  "frontend/src/App.tsx": "Main React flow for multi-step video generation, handling Grok config, clip generation, composition, and navigation.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing themed header, footer, and background visuals for all screens.",
  "frontend/src/components/BottomActionBar.tsx": "Fixed bottom bar rendering a single primary action button with loading and disabled states.",
  "frontend/src/components/ClipSegmentsList.tsx": "Renders a list of generated video segments with status indicators, previews, errors, and retry/back actions. Handles generation progress and optional display of Grok live view.",
  "frontend/src/components/ClipVideoPreview.tsx": "Displays a video clip preview with loading, error, and retry handling, validating the clip URL before rendering. Manages hidden video loading to detect metadata or errors.",
  "frontend/src/components/ComposedVideoPreview.tsx": "Handles composing multiple clip videos into one file, showing progress, errors, and download options. Supports retrying composition and fallback behaviors when composition isn't supported.",
  "frontend/src/components/ErrorNotice.tsx": "Shows a destructive alert with an error message and optional retry or start‑over buttons. Used for general failure states.",
  "frontend/src/components/GrokLiveView.tsx": "Embeds the Grok interface in an iframe with fallback messaging if blocked by browser restrictions. Includes loading state and option to open Grok in a new tab.",
  "frontend/src/components/MobileStepper.tsx": "Displays a mobile-friendly stepper UI showing progress through prompt, clips, compose, and download stages. Highlights current, completed, and upcoming steps.",
  "frontend/src/components/PromptComposer.tsx": "Provides UI for crafting the generation prompt, clip count, durations, and reference images, with validation and Grok runtime configuration management. Supports editing and saving endpoint/API key settings.",
  "frontend/src/components/ReferenceImageUpload.tsx": "Image upload component that validates files, manages previews, enforces limits, and lets users add or remove reference images.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, and restoring identities.",
  "frontend/src/hooks/useLiveGenerationProgress.ts": "Hook that computes live progress and status labels for video clip generation based on segment states.",
  "frontend/src/hooks/useQueries.ts": "Query hooks for fetching a session or user sessions from the backend, with polling and identity-aware enabling.",
  "frontend/src/hooks/useTheme.ts": "Hook for toggling light/dark theme and persisting it in localStorage while updating document classes.",
  "frontend/src/hooks/useVideoProvider.ts": "Hook that exposes the current video provider and tracks whether Grok is properly configured, updating on config changes.",
  "frontend/src/hooks/useVideoSession.ts": "Hook that manages video generation sessions, orchestrating segment prompts, clip generation, statuses, and errors.",
  "frontend/src/index.css": "Tailwind base stylesheet defining light/dark color themes, layout variables, and mobile-friendly global styles.",
  "frontend/src/lib/download.ts": "Provides a robust video downloading utility supporting Blob and remote URLs with extension inference and error handling.",
  "frontend/src/lib/duration.ts": "Contains duration calculation, validation, suggestions, and auto-splitting utilities for video clip timing.",
  "frontend/src/lib/fileEncoding.ts": "Encodes image files to base64 for API use and handles batch encoding with detailed error reporting.",
  "frontend/src/lib/grokEndpoint.ts": "Validates and normalizes Grok API endpoints, including canonical xAI endpoint handling and format checks.",
  "frontend/src/lib/grokRuntimeConfig.ts": "Manages Grok API runtime config in localStorage with validation, change notifications, and legacy endpoint detection.",
  "frontend/src/lib/referenceImages.ts": "Defines rules and helpers for validating, formatting, and generating preview URLs for reference image uploads.",
  "frontend/src/lib/videoCompose.ts": "Implements basic multi‑clip composition flow with progress callbacks, capability checks, and fallback behavior.",
  "frontend/src/lib/videoValidation.ts": "Validates video URLs via HEAD requests or video element loading and checks ClipData structure integrity.",
  "frontend/src/main.tsx": "Bootstraps the React application with query client and Internet Identity provider before rendering App.",
  "frontend/src/providers/grokProvider.ts": "Handles Grok provider config resolution, validates endpoints, encodes reference images, and sends video-generation requests to the Grok API.",
  "frontend/src/providers/videoProvider.ts": "Wraps Grok provider functions as the sole video provider, exposing segment derivation and clip generation APIs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme colors, typography, container settings, and custom utilities.",
  "project_state.json": "Describes the project’s current goals, architecture notes, known issues, and existing feature definitions for the Grok-powered video generator."
}