{
  "backend/main.mo": "Motoko canister managing video sessions, segment metadata, status updates, and user-owned session retrieval with validation and session/segment ID tracking.",
  "feature_evidence.json": "Feature evidence report referencing frontend files related to Grok provider auto-selection and explicit Demo opt-in handling.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each frontend file’s purpose across components, hooks, providers, and utilities.",
  "frontend/index.css": "Tailwind base layer defining light/dark OKLCH color variables, global styles, and theme-aware CSS tokens.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Main app orchestrating the multi-step flow for prompt input, clip generation, composition, and download with provider and session hooks.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper with themed header, footer, background image, and global page structure.",
  "frontend/src/components/BottomActionBar.tsx": "Bottom fixed action bar rendering a single adaptive CTA button with loading and variant support.",
  "frontend/src/components/ClipSegmentsList.tsx": "Displays per-clip generation progress, statuses, icons, and retry actions with overall progress tracking.",
  "frontend/src/components/ComposedVideoPreview.tsx": "Handles video composition flow, showing progress, errors, and final preview with download support.",
  "frontend/src/components/ErrorNotice.tsx": "Displays an error alert with optional retry and start-over actions.",
  "frontend/src/components/MobileStepper.tsx": "Renders a mobile-friendly step indicator for prompt, clips, compose, and download stages.",
  "frontend/src/components/PromptComposer.tsx": "UI for entering prompts, durations, reference images, and provider settings, including Grok runtime configuration.",
  "frontend/src/components/ReferenceImageUpload.tsx": "Manages uploading, validating, previewing, and removing reference images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching a session and user sessions using the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Stores and toggles light/dark theme with persistence in localStorage.",
  "frontend/src/hooks/useVideoProvider.ts": "React hook managing current video provider selection, syncing with Grok configuration changes and handling provider updates.",
  "frontend/src/hooks/useVideoSession.ts": "Manages video generation sessions, handling segment creation, clip generation, status updates, and retries.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, dark mode, typography, and mobile-safe UI adjustments.",
  "frontend/src/lib/duration.ts": "Utility functions for validating durations, suggesting clip settings, and splitting durations across clips.",
  "frontend/src/lib/fileEncoding.ts": "Encodes image files to base64 for API requests and provides helpers for batch encoding.",
  "frontend/src/lib/grokRuntimeConfig.ts": "Handles loading, saving, validating, and subscribing to runtime Grok API configuration stored in localStorage.",
  "frontend/src/lib/referenceImages.ts": "Utilities for validating, formatting, and previewing reference image files with size/type constraints.",
  "frontend/src/lib/videoCompose.ts": "Provides basic browser‑based video composition simulation and a helper for downloading videos.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/providers/grokProvider.ts": "Implements Grok API integration for deriving segments and generating clips, supporting env and runtime config.",
  "frontend/src/providers/videoProvider.ts": "Manages selecting between Grok and demo video providers using config and localStorage, including explicit demo opt‑in logic and persistence rules.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, spacing, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, goals, architectural notes, known issues, and implemented features for the Grok-powered video generation app."
}