{
  "backend/main.mo": "Motoko backend managing video sessions with prompt validation, segment tracking, status updates, and user/session queries.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for build and documentation reference.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark theme color variables and global background/foreground rules.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app orchestrating the multi-step video generation flow with validation, clip generation, composition, and navigation logic.",
  "frontend/src/components/AppShell.tsx": "UI layout wrapper providing header, theme toggle, background styling, and footer around app content.",
  "frontend/src/components/BottomActionBar.tsx": "Fixed bottom CTA bar rendering a configurable action button with loading and disabled states.",
  "frontend/src/components/ClipSegmentsList.tsx": "Displays generation progress and status for video segments, with error handling and retry/back controls.",
  "frontend/src/components/ComposedVideoPreview.tsx": "Handles composing multiple clips into a video, shows progress/error states, and enables downloads.",
  "frontend/src/components/ErrorNotice.tsx": "Renders a destructive alert with a message and optional retry or start-over actions.",
  "frontend/src/components/MobileStepper.tsx": "Shows a four-step mobile progress indicator highlighting the current step.",
  "frontend/src/components/PromptComposer.tsx": "Provides UI for editing prompts, clip settings, reference images, and Grok runtime configuration.",
  "frontend/src/components/ReferenceImageUpload.tsx": "Manages uploading, validating, previewing, and removing reference images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching a session or user sessions from the backend actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and document class updates.",
  "frontend/src/hooks/useVideoProvider.ts": "Tracks and updates the active video provider, syncing with runtime config changes and enforcing provider constraints.",
  "frontend/src/hooks/useVideoSession.ts": "Manages video generation sessions, handling session creation, segment generation, errors, and reference images.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables for light/dark themes with mobile‑friendly adjustments.",
  "frontend/src/lib/download.ts": "Utility for downloading video files from blob or remote URLs with error handling and extension inference.",
  "frontend/src/lib/duration.ts": "Provides duration calculations, validation, suggestions, and clip-splitting helpers for video timing.",
  "frontend/src/lib/fileEncoding.ts": "Encodes image files to base64 for API requests and handles errors for individual or multiple files.",
  "frontend/src/lib/grokEndpoint.ts": "Validates and normalizes Grok API endpoint URLs and provides a quick format check.",
  "frontend/src/lib/grokRuntimeConfig.ts": "Manages Grok runtime config in localStorage, including loading, saving, clearing, and change subscriptions.",
  "frontend/src/lib/referenceImages.ts": "Defines limits and helpers for validating, formatting, and previewing reference image files.",
  "frontend/src/lib/videoCompose.ts": "Provides simple video composition logic with progress callbacks, returning first clip as fallback for multi-clip cases.",
  "frontend/src/lib/videoValidation.ts": "Validates video URLs and clip data using HEAD requests or video element fallback.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/providers/grokProvider.ts": "Resolves Grok configuration, validates settings, encodes reference images, and sends video generation requests to the Grok API.",
  "frontend/src/providers/videoProvider.ts": "Manages video provider selection between Grok and Demo modes with localStorage persistence and config-aware defaults.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, container settings, and plugins for UI styling.",
  "project_state.json": "Project state file defining build summary, architecture notes, known issues, and feature metadata for the video‑generation app."
}