{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Grok prompt-based clip generation reliability and correct Clips progress/preview states",
  "requirements": [
    {
      "id": "REQ-47",
      "summary": "Make Grok prompt-based clip generation reliable (including reference images) and surface clear in-app errors without creating empty/invalid clip URLs.",
      "acceptanceCriteria": [
        "Generating with Grok configured succeeds for at least one clip when using a text prompt with 1 uploaded reference image (e.g., IMG_0793.png), producing a non-empty, playable video URL.",
        "If the Grok API request fails (non-2xx) or returns an unexpected response shape, the clip is marked Failed and the user sees a concise English error message in the clip card (not a blank clip).",
        "The app does not append placeholder ClipData with url: '' on failure; failed clips do not create a preview attempt using an empty URL.",
        "When a request includes reference images and fails, the surfaced error message explicitly indicates that reference images were included and suggests trying again without them (while keeping the underlying technical details available for debugging/logs where applicable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/providers/grokProvider.ts",
          "operation": "modify",
          "description": "Harden Grok response handling by extracting the video URL from multiple plausible response shapes, validating it is a non-empty string, and throwing actionable English errors when non-2xx or unexpected payloads occur; ensure errors mention when reference images were included and log technical details for debugging."
        },
        {
          "path": "frontend/src/hooks/useVideoSession.ts",
          "operation": "modify",
          "description": "Stop appending placeholder clips with empty URLs on failures; maintain clip slots by index (e.g., nullable entries) and only mark a segment completed when the generated clip has a non-empty URL; on per-clip failure, set segment status to Failed with a concise English message that explicitly notes reference images were included (when applicable) and suggests retrying without them, while logging underlying error details."
        },
        {
          "path": "frontend/src/components/ClipSegmentsList.tsx",
          "operation": "modify",
          "description": "Update clip rendering to handle missing/nullable clip entries without attempting preview, and ensure failed segments show a clear in-app error message and Retry action using shadcn-ui (Alert/Button/Card). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust Clips-step gating logic to rely on segment completion plus existence of at least one valid, non-empty clip URL (not truthy empty strings), consistent with removing placeholder failed clip entries."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Correct overall Clips progress calculation and labeling to reflect completed vs failed clips and avoid showing 100% when none completed.",
      "acceptanceCriteria": [
        "If all segments are failed and completedCount is 0, the overall progress displayed is not 100%, and the label indicates generation failed (English).",
        "If some clips completed and some failed, the label clearly shows both counts (e.g., \"1 completed, 1 failed\") and progress represents completed clips only (not \"done\" clips).",
        "While a clip is generating, overall progress continues to update smoothly and never reaches 100% until at least one clip is actually completed (as applicable for the run)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLiveGenerationProgress.ts",
          "operation": "modify",
          "description": "Revise progress computation so progress is based on completed clips only (completedCount/total), never returns 100% when completedCount is 0, and labels explicitly report completed and failed counts; ensure generating-state smoothing never reaches 100% prematurely."
        },
        {
          "path": "frontend/src/components/ClipSegmentsList.tsx",
          "operation": "modify",
          "description": "Ensure the overall progress label and percentage rendering properly reflect the updated hook outputs and clearly indicate the all-failed outcome in English using existing shadcn-ui components. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Remove user-visible native browser video 'Load failed' UI by rendering only stable in-app preview states and providing retry from preview errors.",
      "acceptanceCriteria": [
        "When a generated clip URL cannot be loaded/played, the clip preview area shows the app’s custom error UI (English) with a Retry button, and the browser’s native 'load failed' overlay is not shown.",
        "Retrying from the preview error state triggers the existing retry flow for that clip and updates status/progress accordingly.",
        "The clip preview component does not render a <video> element at all for empty/whitespace URLs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClipVideoPreview.tsx",
          "operation": "modify",
          "description": "Implement a guarded preview state machine (loading/ready/error) that pre-validates non-empty URLs before rendering a visible <video>, shows a custom in-app loading and error UI, and unmounts/hides the <video> immediately on playback/load errors to avoid native 'Load failed' overlays; keep Retry wired to the provided onRetry callback using shadcn-ui (Alert/Button). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/videoValidation.ts",
          "operation": "modify",
          "description": "Add/adjust a frontend-safe validation helper used by ClipVideoPreview to quickly reject empty/whitespace URLs and provide clearer validation error messages for UI display without relying on visible <video> rendering."
        },
        {
          "path": "frontend/src/components/ClipSegmentsList.tsx",
          "operation": "modify",
          "description": "Ensure the preview area is only rendered for completed segments with a valid non-empty URL, otherwise show the app’s custom error UI with Retry (and no <video> element) using shadcn-ui components. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}