{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix native URL validation and harden Grok runtime config + generation error states",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Eliminate browser-native constraint validation during Grok runtime endpoint entry and replace with in-app English validation messaging.",
      "acceptanceCriteria": [
        "Attempting to generate a video must not trigger any browser-native validation tooltip/toast that says \"The string did not match the expected pattern.\"",
        "If the Grok API endpoint is invalid, show an in-app error (toast and/or inline message) in English explaining what is wrong and how to fix it (e.g., must start with http:// or https://).",
        "The runtime Grok endpoint input must accept common valid endpoints (including those with paths) and must not hard-fail due to overly strict HTML input validation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PromptComposer.tsx",
          "operation": "modify",
          "description": "Replace browser-native URL constraint validation with app validation: change the Grok endpoint input away from strict HTML validation (e.g., avoid type=\"url\"), add inline error text for invalid endpoints, and use existing shadcn-ui form primitives (Input/Alert/Label) plus sonner toast for English messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/grokRuntimeConfig.ts",
          "operation": "modify",
          "description": "Update runtime Grok config saving/loading to support normalized endpoints and to surface clear validation errors (no reliance on browser-native constraint validation)."
        },
        {
          "path": "frontend/src/lib/grokEndpoint.ts",
          "operation": "create",
          "description": "Add a small utility to validate and normalize Grok API endpoints (http/https required, allow paths, trim whitespace, remove trailing slashes, and provide English error strings suitable for UI to display)."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Harden runtime Grok configuration handling so invalid endpoint values cannot be saved or allow the flow to advance into later steps.",
      "acceptanceCriteria": [
        "Saving runtime Grok settings with an invalid endpoint does not save to localStorage and shows an English error explaining the expected format.",
        "When a runtime endpoint is saved, it is normalized to a consistent format (e.g., trims whitespace and removes trailing slashes) so fetch calls do not produce malformed URLs.",
        "If generation is initiated while Grok is selected but configuration is missing/invalid, the app remains on the Prompt step and shows an English error describing how to configure Grok (runtime settings or env vars)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/grokRuntimeConfig.ts",
          "operation": "modify",
          "description": "Validate + normalize endpoint before saving; if invalid, do not write to localStorage and throw/return an actionable English error for the UI to display (also keep existing config-change event behavior only on successful save)."
        },
        {
          "path": "frontend/src/providers/grokProvider.ts",
          "operation": "modify",
          "description": "Ensure Grok config resolution uses the normalized endpoint format (and defensively normalizes env-provided endpoints) so fetch URL construction is stable and does not create malformed URLs."
        },
        {
          "path": "frontend/src/hooks/useVideoSession.ts",
          "operation": "modify",
          "description": "Prevent generation from \"starting\" when provider configuration is missing/invalid: add a preflight check and return a success/failure signal (and/or store a generation-blocked error) so the UI can stay on the Prompt step and display an actionable English message via toast/inline messaging."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Change step advancement logic so the app only moves from Prompt → Clips after startGeneration successfully begins; if Grok is selected but missing/invalid config, keep the user on Prompt and show an English error (toast and/or inline) describing how to configure Grok (runtime settings or env vars). Use existing shadcn-ui Toaster integration for messaging. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Provide clear, user-visible error states when generation cannot start or fails immediately (including with reference images), without silently changing provider selection.",
      "acceptanceCriteria": [
        "If segment derivation fails before any segments are created, the user sees a clear English error and a clear path to recover (e.g., edit settings and try again) without being left on an empty/blocked Clips step.",
        "Errors related to reference image encoding/upload (if any) are surfaced in English and identify that reference images were included in the request.",
        "The error experience does not silently switch providers or otherwise change the user’s provider selection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useVideoSession.ts",
          "operation": "modify",
          "description": "Add explicit, user-facing error state for the overall generation run (e.g., derive-segments failure before segments exist), including an indicator when reference images were included; ensure failures set this error state and do not leave the UI in a blank/blocked state."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "When on Clips step with no segments due to an early failure, render a clear recovery UI using the existing ErrorNotice component (retry and/or return to Prompt to edit settings), and avoid advancing to later steps until generation is viable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ClipSegmentsList.tsx",
          "operation": "modify",
          "description": "Handle the case where there are zero segments due to an early failure by showing a clear empty/error-friendly state when provided with a run-level error message (without altering provider selection). Use existing shadcn-ui Card/Alert primitives for consistency. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/providers/grokProvider.ts",
          "operation": "modify",
          "description": "Improve error messages around reference image handling: if reference images were included and encoding or request preparation fails, throw an English error that explicitly mentions reference images were included (and suggests removing them or trying again) while keeping provider selection unchanged."
        },
        {
          "path": "frontend/src/lib/fileEncoding.ts",
          "operation": "modify",
          "description": "Ensure any failures during reference image base64 encoding produce actionable Errors that can be surfaced to the UI (English messaging), so grokProvider/useVideoSession can display clear run-level errors when images are included."
        }
      ]
    }
  ]
}